cask_args appdir: "/Applications"
#
# Ask root privileges
#
cask "basictex"
cask "bettertouchtool"
cask "bitwarden"
cask "calibre"
cask "charles"
cask "daisydisk"
cask "figma"
cask "font-roboto"
cask "google-chrome"
cask "google-backup-and-sync"
cask "java"
cask "meetingbar"
cask "obsidian"
cask "postman"
cask "provisionql"
cask "rectangle"
cask "slack"
cask "skype"
cask "telegram"
cask "visual-studio-code"
cask "zeplin"
