tap "mongodb/brew"

### Developer Tools
brew "alacritty"
brew "appledoc"
brew "bat"
brew "brew-cask-completion"
brew "ctags"
brew "dart-lang/dart/dart"
brew "fastlane"
brew "ghc"
brew "grip"
brew "golang"
brew "haskell-stack"
brew "kotlin"
brew "mergepbx"
brew "mongodb-community"
brew "node"
brew "procs"
brew "python"
brew "rbenv"
brew "rust", link: false
brew "sourcery"
brew "tree"
brew "swiftformat"
brew "swiftlint"
brew "watchman"
brew "yarn"
