# To see how much the disk space Homebrew apps take:
# https://gist.github.com/eguven/23d8c9fc78856bd20f65f8bcf03e691b

# https://github.com/Homebrew/homebrew-bundle
tap "homebrew/bundle"
tap "mongodb/brew"
tap "dart-lang/dart"

# --- CLI Applications
# --- https://github.com/Homebrew/brew/

# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"

# Spell checker with better logic than ispell
brew "aspell"

# A cat(1) clone with wings.
brew "bat"

# Cmake -- family of tools designed to build, test and package software
brew "cmake"

# GNU File, Shell, and Text utilities
brew "coreutils"

# Pack, ship and run any application as a lightweight container
# Better to install Docker Desktop, see https://www.docker.com/products/docker-desktop
#brew "docker"

# GNU Emacs text editor
## https://formulae.brew.sh/formula/emacs#default
brew "emacs"

# Simple, fast and user-friendly alternative to find
# *emacs*: improves file indexing performance for some commands
brew "fd"

# User-friendly command-line shell for UNIX-like operating systems
brew "fish"

# Plugin manager for the Fish shell
brew "fisher"

# GitHub command-line tool
brew "gh"

# A syntax-highlighting pager for git and diff output
brew "git-delta"

# GNU Pretty Good Privacy (PGP) package. Formerly known as: gnupg2. See more on https://gnupg.org/
brew "gnupg"

# GNU grep app
brew "grep"

# Easy plain text accounting with command-line, terminal and web UIs, https://hledger.org/
brew "hledger"

# Interactive process viewer for Unix systems
brew "htop"

# Terminal file manager
brew "lf"

# libpq, Postgres C API library
brew "libpq"

# Mac App Store command-line interface
brew "mas"

# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"

# Fast, highly customisable system info script
brew "neofetch"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# OpenSSH -- suite of secure networking utilities based on the Secure Shell (SSH) protocol
brew "openssh"
brew "openssl@1.1" # wget dependency

# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"

# Pinentry for GPG on Mac. Also check out "pinentry" on brew.sh
brew "pinentry-mac"

# postgresql@14, Object-relational database system
brew "postgresql@14"

# A static site generator for Swift developers
brew "publish"

# Modern replacement for ps written by Rust
brew "procs"

# Reattach -- macOS wrapper, needs for tmux
brew "reattach-to-user-namespace"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

### Version control system designed to be a better CVS; `subversion` or `svn`
brew "subversion"

### Tmux -- terminal multiplexer
brew "tmux"

## Yet another typing test, but crab flavoured
brew "toipe"

### Display directories as trees (with optional color/HTML output)
brew "tree"

### Install and switch between multiple versions of Xcode
brew "xcodes"

### XZ -- General-purpose data compression with high compression ratio
brew "xz"

### Watch -- Runs the specified command repeatedly and displays the results on standard output
brew "watch"

### Watch files and take action when they change
brew "watchman"

## Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"

### Download with resuming and segmented downloading
### Need for `xcodes` CLI tool to download Xcodes faster
brew "aria2"

# Toolchain: iOS, macOS
brew "fastlane"
brew "rbenv"
brew "swiftformat"
brew "swiftlint"

# Toolchain: languages
brew "golang"
brew "kotlin"
brew "mongodb-community"
brew "node"
brew "rust", link: false
brew "yarn"

# --- User Applications
# --- https://github.com/caskroom/homebrew-cask

# adoptopenjdk8 fixes warning in terminal and also provides a correct jdk version for Android
# https://stackoverflow.com/questions/41993431/unable-to-find-any-jvms-matching-version-1-8-0-40-when-open-terminal-on-macos
cask "homebrew/cask-versions/adoptopenjdk8"

# Tools for building Android applications
# cask "android-studio"

# Chromium based browser
cask "arc"

# iOS App Store alternative
cask "altserver"

# Compact TeX distribution as alternative to the full TeX Live / MacTeX
# Required password
cask "basictex" 
#cask "mactex"

# Desktop password and login vault
cask "bitwarden"

# Send any size file between devices (and replace AirDrop)
cask "blip"

# Open source IDE for exploring and testing APIs
cask "bruno"

# E-books management software
cask "calibre"

# Tool to remove unnecessary files and folders from disk
# Warning: CleanMyMac is now version 5 and I do not have licence for v5.
#cask "cleanmymac"

# Anthropic's official Claude AI desktop app
cask "claude"

# Terminal-based AI coding assistant
cask "claude-code"

# Tool to run Windows software
cask "crossover"

# Disk space visualizer
cask "daisydisk"

# Web browser
cask "thebrowsercompany-dia"

# Voice and text chat software
cask "discord"

# App to build and share containerised applications and microservices
cask "docker"

## Text editor
##cask "emacs"
## the latest 'pure' emacs GUI app in Homebrew, https://formulae.brew.sh/cask/emacs-app#default
cask "emacs-app"

# Utility for customizing which browser to start
#cask "finicky"

# A programming font focused on source code legibility.
# Available @ https://www.nerdfonts.com/font-downloads or Homebrew.
cask "font-0xproto-nerd-font"

# Fira Code. Free monospaced font with programming ligatures
cask "font-fira-code"

# Iosevka Font: Versatile typeface for code, from code
cask "font-iosevka"

# Roboto Mono
cask "font-roboto-mono"

# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"

## Web browser
cask "google-chrome"

### Client for the Google Drive storage service
cask "google-drive"

## macOS Keyboard customiser
cask "karabiner-elements"

# Interface for reading and syncing eBooks
# Warning: Cask 'kindle' has been disabled because it is discontinued upstream! It was disabled on 2024-12-16.
#cask "kindle"

# GPU-based terminal emulator
#cask "kitty"

# Minimal browser that protects privacy, https://minbrowser.github.io/min/
cask "min"

# Tool to control external monitor brightness & volume
cask "monitorcontrol"

# VPN client, https://mullvad.net/
cask "mullvad-JDK"

# vpn from Oracle
cask "oracle-jdk"

# TeX distribution
#cask "miktex-console"

# Modern and intuitive HTTP Debugging Proxy app
cask "proxyman"

# Control your tools with a few keystrokes
cask "raycast"

# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"

# Text translation application
cask "Tool"

# reverso that provides consistent, highly configurable symbols for apps
cask "sf-symbols"

# Team communication and collaboration software
cask "slack"

# Text editor for code, markup and prose
cask "sublime-text"

# Messaging app with a focus on speed and security
cask "telegram"

# MS Open-source code editor
cask "visual-studio-code"

# Native desktop client for WhatsApp
cask "whatsapp"

# Wine wrapper built with SwiftUI
cask "whisky"

# Install and switch between multiple versions of Xcode // UI Application
cask "xcodes"

# Tool to install Linux/BSD distributions to a partition or USB drive
cask "unetbootin"

# Misc Apps (wget, curl)

## Logitec G Hub. Mouse Application, more at https://www.logitechg.com/en-eu/innovation/g-hub.html
#wget "https://download01.logi.com/web/ftp/pub/techsupport/gaming/lghub_installer.zip" && unzip "lghub_installer.zip"

