# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "mongodb/brew"

# Homebrew. My Core Apps 🥜
# https://github.com/Homebrew/brew/

# Antibody -- Zsh plugin manager
brew "getantibody/tap/antibody"
# Cmake -- family of tools designed to build, test and package software
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Differ -- Good-lookin' diffs. Actually… nah… The best-lookin' diffs.
#brew "diff-so-fancy"
# A viewer for git and diff output
brew "git-delta"
# Grep -- GNU grep app
brew "grep"
# HTop -- interactive process viewer for Unix systems
brew "htop"
# LF -- terminal file manager
brew "lf"
# Mas -- Mac App Store command line interface
brew "mas"
# OpenSSH -- suite of secure networking utilities based on the Secure Shell (SSH) protocol
brew "openssh"
brew "openssl@1.1" # wget dependency
# Reattach -- macOS wrapper, needs for tmux
brew "reattach-to-user-namespace"
# Tmux -- terminal multiplexer
brew "tmux"
# Watch -- Runs the specified command repeatedly and displays the results on standard output
brew "watch"
# XZ -- General-purpose data compression with high compression ratio
brew "xz"

# Homebrew. Developer Tools 🍺
brew "bat"
brew "brew-cask-completion"
brew "ctags"
brew "dart-lang/dart/dart"
brew "fastlane"
brew "ghc"
brew "grip"
brew "golang"
brew "haskell-stack"
brew "kotlin"
brew "mergepbx"
brew "mongodb-community"
brew "node"
brew "procs"
brew "rbenv"
brew "rust", link: false
brew "tree"
brew "svn"
brew "swiftformat"
brew "swiftlint"
brew "watchman"
brew "yarn"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "alacritty"
cask "basictex"
cask "bitwarden"
cask "cleanmymac"
cask "daisydisk"
cask "figma"
cask "font-roboto"
cask "google-chrome"
cask "google-drive"
cask "oracle-jdk"
cask "meetingbar"
cask "obsidian"
cask "postman"
cask "rectangle"
cask "slack"
cask "telegram"
cask "visual-studio-code"

# adoptopenjdk8 fixes warning in terminal and also provides a correct jdk version for Android
# https://stackoverflow.com/questions/41993431/unable-to-find-any-jvms-matching-version-1-8-0-40-when-open-terminal-on-macos
cask "homebrew/cask-versions/adoptopenjdk8"
