brew "appledoc"
brew "brew-cask-completion"
brew "ghc"
brew "cabal-install"
brew "carthage"
brew "ctags"
brew "python"
brew "gradle"
brew "grip"
brew "haskell-stack"
brew "kotlin"
brew "maven"
brew "mergepbx"
brew "mono"
brew "mosh"
brew "node"
brew "numpy"
brew "putty"
brew "rbenv"
brew "ruby", link: true
brew "rust", link: false
brew "sourcery"
brew "tree"
brew "watchman"
brew "yarn"
brew "dart-lang/dart/dart"
brew "swagger-codegen"
brew "swiftformat"
