tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "dart-lang/dart"
tap "phinze/cask"

brew "cask"
brew "cloc"
brew "cmake"
brew "diff-so-fancy"
brew "ffmpeg"
brew "gifsicle"
brew "grep"
brew "htop"
brew "hub"
brew "mas"
brew "mdp"
brew "minicom"
brew "openssh"
brew "screen"
brew "wget", args: ['--with-iri']
brew "xz"
brew "zsh"
brew "tmux"
brew "reattach-to-user-namespace"
brew "watch"
brew "getantibody/tap/antibody"
