cask_args appdir: "/Applications"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "phinze/cask"

brew "appledoc"
brew "brew-cask-completion"
brew "ghc"
brew "cabal-install"
brew "carthage"
brew "cask"
brew "cloc"
brew "cmake"
brew "ctags"
brew "diff-so-fancy"
brew "ffmpeg"
brew "gifsicle"
brew "xz"
brew "python"
brew "gradle"
brew "grip"
brew "haskell-stack"
brew "htop"
brew "hub"
brew "kotlin"
brew "mas"
brew "maven"
brew "mergepbx"
brew "minicom"
brew "mono"
brew "mosh"
brew "node"
brew "numpy"
brew "putty"
brew "rbenv"
brew "ruby", link: true
brew "rust", link: false
brew "sourcery"
brew "tree"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "dart-lang/dart/dart"
brew "swagger-codegen"
brew "mdp"
brew "swiftformat"

cask "google-chrome"
cask "iterm2"
cask "charles"
cask "phinze/cask/dropbox"
cask "phinze/cask/fastlane"
cask "phinze/cask/java"
cask "phinze/cask/qlmarkdown"
cask "phinze/cask/reveal"
cask "phinze/cask/soundcleod"
cask "phinze/cask/vlc"
cask "phinze/cask/xquartz"
cask "phinze/cask/zeplin"
cask "provisionql"
cask "homebrew/cask-versions/java8"
