alefragnani.project-manager
andenetalexander.vim-cheatsheet
astro-build.astro-vscode
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
deerawan.vscode-dash
denoland.vscode-deno
donjayamanne.githistory
editorconfig.editorconfig
esbenp.prettier-vscode
figma.figma-vscode-extension
firsttris.vscode-jest-runner
github.vscode-pull-request-github
golang.go
grapecity.gc-excelviewer
justusadam.language-haskell
kumar-harsh.graphql-for-vscode
mariomatheu.syntax-project-pbxproj
mark-hansen.hledger-vscode
mathematic.vscode-latex
mathiasfrohlich.kotlin
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
octref.vetur
prisma.prisma
redhat.java
resend.react-email-preview
ritwickdey.liveserver
shopify.ruby-lsp
sswg.swift-lang
tomoki1207.pdf
twxs.cmake
unifiedjs.vscode-mdx
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vscodevim.vim
wayou.vscode-todo-highlight
wix.vscode-import-cost
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
